export const rawWatchRecordText = String.raw`
金色时光(青春纪行)24
达尔文游戏12
刀剑神域二季+爱丽丝篇三季+ggo剧场版+无星之夜的咏叹调+序列之争+extra edition+进击篇暮色黄昏+外传Gun Gale Online 第二季 12
缘之空12
小林家的龙女仆2季
转生成蜘蛛又怎样24
打工吧魔王大人二季25集
无职转生二季2part
终末的女武神2季26
剃须然后捡到女高中生12
打了300年史莱姆不知不觉满级12
新妹魔王的契约者 12...
魔王学院的不适任者二季 24
JOJO的奇妙冒险 123456部 -- 完结
约会大作战12345 -- 完结 ➕狂三外传
我想吃掉你的胰脏
天气之子
你的名字
漆黑的子弹13
魔女之旅 12
青梅竹马不会输的恋爱喜剧 12
这个勇者明明超强却过分慎重 12
为美好的世界献上祝福3季+红传说
+为美好的世界献上爆炎 12
妖狐X仆SS 13
我女友与青梅竹马的惨烈修罗场
终结的炽天使 12+名古屋决战 24
五等分的花嫁2季 24+剧场版
斩赤红之瞳 24
在魔王的城堡说晚安 12
冰菓 22
Darling in Frankxx(国家队) 24
星刻的龙骑士 12
游戏人生 12+剧场版
re 0 从零开始的异世界生活 三季（前后半） 79 + 剧场版2部
咒文禁忌 12（垃圾）
咒术回战二季 47+剧场版
东京喰种四季
鬼灭之刃（漫画至少看完了）
干物妹小埋12+ova
变态王子与不笑猫 12
不正经的魔法讲师 15
只要可爱即使是变态 12
夏洛特 13
贤者之孙 12
高校之神12
青春笨蛋少年不做兔女郎学姐的梦13
青春笨蛋少年不做怀梦美少女的梦
青春笨蛋少年不做娇怜外出妹的梦
青春笨蛋少年不做小学美少女的梦
青春笨蛋少年不做圣诞服女郎的梦
月色真美12
樱花庄的宠物女孩24
境界的彼方12+过去未来篇
武装少女12
中二病也要谈恋爱2季+take on me剧场 + 恋 lite
工作细胞2季+black
昴宿七星12
辉夜大小姐三季+初吻不会结束(剧场版) + 通往大人的阶梯 2
街角魔族二季 24
关于我女友是一个一本正经的处女碧池10
笨女孩12
一拳超人2季24
总之就是非常可爱2季+制服篇+女子高中篇
平凡职业造就世界最强三季 42
吸血鬼马上死 12-？
Hello World！
重来吧，魔王大人 12
Clannad 2季+ova2部
回复术士的重启人生12
滑头鬼之孙2季52
Litter Buster26+refrain13
侦探已经死了12（几年没动静了）
立于百万生命之上2季24
女友成双12
在下坂本有何贵干13
东京复仇者24+圣夜决战篇13+天竺篇13
我们的重制人生12
异世界迷宫黑心企业12
见面之后五秒开始战斗12
月光下的异世界之旅12
死神少爷与黑女仆三季36（完）
我的青春恋爱物语果然有问题2季26
开挂药师的异世界生活12
刃牙123季+范马刃牙第二季13
末日三问12
成神之日12
伤物语 三部+ 化物语15+花物语5+恋物语6+猫物语（黑4+白5）+忍物语+怪物语 （14） + 终？伪
宿命回响12
世界顶尖的暗杀者转生成异世界贵族12
大正少女御伽话12
关于前辈很烦人的事12
秒速五厘米
龙王的工作12
徒然喜欢你12
天使的心跳(Angel Beats)12
田中君总是如此慵懒12
这个美术社大有问题12
黑社会的超能力女儿12
妖精森林的小不点13
珈百璃的堕落14
看得见的女孩12
Air 13
龙与虎26
地缚少年花子君 二季 36
日常26
未闻花名12
羁绊者12
天使降临我身边13+剧场版
杀戮天使16
女神宿舍的宿管君10
某科学的超电磁炮三部 约75
某科学的一方通行12
古见同学有交流障碍症2季 36
心灵代码 12
弩级战队H 11
没有黄段子的无聊世界 12
为什么老师在这里 （？？？）
魔法禁书目录 3季 74 + 剧场版
欢迎来到实力主义至上教室三季 38
因为太怕痛所以全点了防御 二季 24
death note 37
我被逐出队伍后过上慢生活 二季 25
家有女友 12
异种族风俗娘评选指南12（？！）
灵能百分百三季 37
宇崎学妹想要玩二季 25
真理面具 20
言叶之庭
百妖谱二季+京师篇
野良神 2季 25
异度入侵 13
多罗罗 24
致不灭的你 2季 40
堀与宫村 2季 26
虚构推理 2季 24
碧蓝之海 二季 24
理科生坠入情网 2季 24
日在校园14
转生成为了只有乙女游戏破灭flag的邪恶大小姐 2季
喜欢本大爷的就你一个 12
极主夫道2part-15
吊带袜天使 2季 26
食戟之灵 5季
石纪元（新石纪） 4季 + 特别篇
四月是你的谎言 22
全员恶玉 12
未来日记 26
擅长捉弄的高木同学3季+剧场版
国王排名 23
战斗员派遣中 12
约定的梦幻岛 2季
盾之勇者成名录 三季
阿宅的恋爱有点难 11
不是说了能力值要平均吗 12
好比是最终迷宫前的少年到新手村生活的故事 12
就算是哥哥只要有爱就没问题了吧 12
更衣人偶坠入爱河 二季 36
关于我转生史莱姆 3季 72+剧场版 红莲之绊+ 彩叶草之梦 3
夏日幻魂
终末的后宫 11
双星之阴阳师 50
声之形
入间同学入魔了 3季
公主连结 2季
后街女孩 10
天才王子的赤子振兴术 12
装甲重拳 2季 26
路人女主的养成方法 2季 25 + fine剧场版
紫罗兰永恒花园 13
伪恋 2季 32
租借女友 三季 36
齐木楠雄的灾难 2季
炎炎消防队 2季 48
淫乱的青酱不能学习 12
游戏三人娘 12
怪物事变 12
无能力者娜娜 13
少女终末旅行 12
CAROLE ＆ TUESDAY  24
你与我最后的战场，亦或是世界起始的圣战12
忧国的莫里亚蒂 24
冰海战记 两季 48
尸体派对 4
替身another 13
恶魔之子 10
异世界食堂 2季 24
relife 17
罪恶王冠 23
实况主的逃脱游戏 13
赛马娘 2季 26
测不准的阿波连同学 2季 24
瓦尼塔斯的手记 24
宝石之国 12
邻家索菲 12
暗杀教室 2季 47
间谍过家家三季50 + 剧场版代号：白
可塑性记忆 13
邻座的怪同学 14
萤火之森
埃罗芒阿老师 12
雾山五行 3季
我太受欢迎了怎么办 12
式守同学不止可爱 12
魔法少女小圆 12 + 外传 2季 25
神之塔 13
契约之吻 13
变身成黑辣妹之后就和死党上床了 8
86-不存在的战区 2季 34
玉子市场 12 + 玉子爱情故事
想哭的我戴上了猫的面具
lycoris recoil 莉可丽丝 13  小剧场 6
夏日重现 25
赛博朋克：边缘行者 10
文豪野犬五季+剧场版 DEAD APPLE
派对浪客诸葛孔明 12
彻夜之歌 二季 25
她和她的猫 4话
女高中生的虚度日常 12
从零开始的魔法书 12
恋爱游戏世界对路人角色很不友好 12
恋如雨止 12
blood-c  12
孤独摇滚 12
电锯人 12  + Reze篇
奇幻世界舅舅 13
散华礼弥 14
别当欧尼酱了 12
政宗君的复仇（烂...）12
轻音少女二季 14 + 27  and  剧场版
强风吹拂 23（！）
GOSICK 24
通往夏天的隧道，再见的出口
蜘蛛侠：平行世界+纵横宇宙
久保同学不放过我 12
やがて君になる 终将成为你 13
我推的孩子 二季 24
物理魔法使马修二季 24
柑橘味香气 12
亡骸游戏 二季 24
日常系的异能战斗 12
命运石之门 第一季 25 + 第二季 23 + ova +web +sp（β线）
其实，我乃最强 12
利兹与青鸟
BanG It's MyGO  13
皇家国教骑士团 13 + ova
魔法使的新娘 第二季 48+剧场版：等待繁星之人+西之少年与青岚的骑士
吹响吧，上低音号 三季 40 + 剧场版：誓言的终章+合奏篇
16bit的感动  13
僕の心ろのやばいやつ（我心危！）第二季25
葬送的芙莉莲 二季 38
不死不幸 24
你想活出怎样的人生
梦想成为魔法少女 13
香格里拉边境 二季 50
跃动青春 12
邪神与厨二病少女3季 36
摇曳露营3季37+sp 6+剧场版
迷宫饭 24
Grils Band Cry 哭泣少女乐队 13
Ave Mujika  13
夜晚的水母不会游泳 12
恋与轻唱10+2特别场（2集延期）
鹿乃子乃子乃子虎视眈眈 12
不時轻声以俄语遮羞的邻座艾莉同學 12
义妹生活  12
深夜 PUNCH 12
魔法少女与恶曾是敌人 12
败犬女主太多了 12
蓝色监狱 二季38 + 凪 剧场版
dddd 恶魔的破坏 17
亚托莉 -我挚爱的时光 13
我独自升级 二季 25
月刊少女野崎君 12
期待在地下城邂逅有错吗 五季  +  ova   75    +     外传12
漩涡 4
超超超超喜欢你的100个女朋友 2季 36
胆大党 2季 24
空之境界  全册四系列
蓦然回首
双城之战 二季 18
甘城光辉游乐园 14+SP
和山田谈场lv999的恋爱 13
青之箱 25（かみだ!）
药屋少女的呢喃 24（第二季wait）
斩服少女 24（老神作了）
岁月流逝饭菜依旧美味 12
mono しょうじょ 12
想要成为影之实力者 2季 32
避难所
亚人 二季 26
血界战线 二季 24
花开伊吕波 26 + 剧场版-Home Sweet Home
我們不可能成為戀人！絕對不行。（※似乎可行？） 12
光死去的夏天 12
章鱼哔的原罪 6
末日后酒店 12
沉默美女的秘密 13
魔女守护者 25
薰香花朵凌然绽放 13
前桥魔女 12
小城日常 13
金牌得主 二季 22
你的颜色
lain 玲音13
`.trim();

export const rawWatchRecords = rawWatchRecordText
  .split(/\r?\n/u)
  .map((line) => line.trim())
  .filter(Boolean);
